** Saving OSCCAL word
I can read current calibration with 

#+BEGIN_SRC shell :var PICNAME="PIC12F675" pk2cmd="/home/zellerin/staging/pickit/pk2cmdv1.20LinuxMacSource/pk2cmd" :results verbatim :exports both 
${pk2cmd} /P${PICNAME} /GP0x3ff-0x3ff
#+END_SRC

#+RESULTS:
: Program Memory
: 000003FF 003412  

If you get word starting with 0x34, you are fine. 0x3fff means it was
cleared out. Anything else is strange.

